---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarInSystem.GetReinforcementRoundingManager
source: html/4143079d-d390-cb24-df50-cf7ae57dca26.htm
---
# Autodesk.Revit.DB.Structure.RebarInSystem.GetReinforcementRoundingManager Method

Returns an object for managing reinforcement rounding override settings.

## Syntax (C#)
```csharp
public RebarRoundingManager GetReinforcementRoundingManager()
```

## Returns
The rounding manager.